package zz.zept.yczd.bean;

import java.util.List;

/**
 * Created by sld on 2016/12/9.
 */

public class TrendBean {
    /**
     * code : success
     * data : [{"PID":0,"name":"国家电投","DID":1},{"PID":1,"name":"河南电力有限公司","DID":2},{"PID":2,"name":"平顶山分公司","DID":21},{"PID":2,"name":"开封分公司","DID":22},{"PID":2,"name":"豫新发电","DID":23},{"PID":2,"name":"南阳热电","DID":24},{"PID":1,"name":"东北电力有限公司","DID":3},{"PID":3,"name":"燕山湖电厂","DID":26},{"PID":2,"name":"平东热电","DID":25},{"PID":2,"name":"郑州燃机","DID":27},{"PID":11052,"name":"#1炉C磨煤机","DID":1070},{"PID":11052,"name":"#1炉A磨煤机","DID":1068},{"PID":11052,"name":"#1炉E磨煤机","DID":1072},{"PID":11053,"name":"#2机A循环水泵","DID":1074},{"PID":11053,"name":"#2机A凝结水泵","DID":1076},{"PID":11053,"name":"#2机C循环水泵","DID":1078},{"PID":11053,"name":"#2炉A一次风机","DID":1080},{"PID":11053,"name":"#2炉A引风机","DID":1082},{"PID":11053,"name":"#2炉A送风机","DID":1084},{"PID":11053,"name":"#2炉A磨煤机","DID":1086},{"PID":11050,"name":"#1机A凝结水泵","DID":2102},{"PID":11050,"name":"#1机A汽动给水泵","DID":2104},{"PID":11050,"name":"#1机B汽泵小汽轮机","DID":2106},{"PID":11050,"name":"#1炉A一次风机","DID":2108},{"PID":11050,"name":"#1炉B送风机","DID":2110},{"PID":11051,"name":"#2机A循环水泵","DID":2112},{"PID":11051,"name":"#2炉B送风机","DID":2114},{"PID":7102,"name":"#6机A凝结水泵电机后轴承","DID":2116},{"PID":7102,"name":"#6机B凝结水泵","DID":2118},{"PID":7102,"name":"#6炉A送风机出口电动调节挡板轴承","DID":2121},{"PID":7102,"name":"#6炉A送风机推力轴承","DID":2122},{"PID":7102,"name":"#6炉B一次风机","DID":2123},{"PID":7102,"name":"#6炉B一次风机出口电动调节挡板轴承","DID":2124},{"PID":7102,"name":"#6炉B送风机","DID":2125},{"PID":7102,"name":"#6炉B送风机推力轴承","DID":2126},{"PID":7102,"name":"#6炉B送风机支力轴承1","DID":2127},{"PID":7103,"name":"#7机A凝结水泵","DID":2128},{"PID":7103,"name":"#7机A循环水泵","DID":2130},{"PID":7103,"name":"#7机B循环水泵","DID":2131},{"PID":7103,"name":"#7炉A一次风机","DID":2132},{"PID":7103,"name":"#7炉A一次风机径向轴承","DID":2133},{"PID":7103,"name":"#7炉A一次风机角接球触轴承","DID":2134},{"PID":7103,"name":"#7炉A引风机","DID":2135},{"PID":7103,"name":"#7炉A引风机电机前支撑轴承","DID":2136},{"PID":7103,"name":"#7炉A送风机推力轴承","DID":2138},{"PID":7103,"name":"#7炉B一次风机","DID":2140},{"PID":7103,"name":"#7炉B一次风机角接球触轴承","DID":2142},{"PID":7103,"name":"#7炉B引风机","DID":2143},{"PID":7103,"name":"#7炉B引风机电机前支撑轴承","DID":2144},{"PID":7103,"name":"#7炉B送风机","DID":2145},{"PID":7103,"name":"#7炉B送风机推力轴承","DID":2146},{"PID":7103,"name":"#7炉B送风机支承轴承1","DID":2147},{"PID":7106,"name":"#1机#1凝结水泵","DID":2148},{"PID":7106,"name":"#1机#1定冷水泵","DID":2149},{"PID":7106,"name":"#1机#1循环水泵","DID":2150},{"PID":7106,"name":"#1机#2循环水泵","DID":2151},{"PID":7106,"name":"#1机密封油真空泵","DID":2152},{"PID":7106,"name":"#1机直流密封油泵","DID":2153},{"PID":7106,"name":"#1机＃2密封油泵","DID":2154},{"PID":7106,"name":"#1炉#1高压给水泵","DID":2155},{"PID":7106,"name":"#1炉#2中压给水泵","DID":2156},{"PID":7106,"name":"#1炉#2高压给水泵","DID":2157},{"PID":7107,"name":"#2机#1循环水泵","DID":2158},{"PID":7106,"name":"#1空压机","DID":2160},{"PID":7104,"name":"#1循环水泵电机","DID":2162},{"PID":7104,"name":"#1机#3凝结水泵电机","DID":2168},{"PID":7104,"name":"#1机#2真空泵","DID":2166},{"PID":7104,"name":"#1炉#1一次风机","DID":2170},{"PID":7104,"name":"#1炉#1引风机","DID":2172},{"PID":7104,"name":"#1炉#1送风机","DID":2174},{"PID":7104,"name":"#1炉#2一次风机","DID":2176},{"PID":7104,"name":"#1炉#2引风机","DID":2178},{"PID":7104,"name":"#1炉#2送风机","DID":2180},{"PID":7105,"name":"#2循环水泵电机","DID":2182},{"PID":7105,"name":"#2机#2凝结水泵电机","DID":2184},{"PID":7105,"name":"#2机#2给水泵电机后轴承轴向振动","DID":2186},{"PID":7105,"name":"#2炉#1一次风机电机","DID":2188},{"PID":11053,"name":"#2汽轮机","DID":1051},{"PID":11052,"name":"#1机B汽动给水泵","DID":1053},{"PID":11053,"name":"#2机B汽动给水泵","DID":1055},{"PID":11052,"name":"#1机B循环水泵","DID":1057},{"PID":11052,"name":"#1机A凝结水泵","DID":1059},{"PID":11052,"name":"#1机C凝结水泵","DID":1061},{"PID":11052,"name":"#1炉B一次风机","DID":1063},{"PID":11052,"name":"#1炉B引风机","DID":1065},{"PID":11053,"name":"#2炉F磨煤机","DID":2100},{"PID":7103,"name":"#7炉A送风机","DID":2137},{"PID":7103,"name":"#7炉A送风机支承轴承1","DID":2139},{"PID":7103,"name":"#7炉B一次风机径向轴承","DID":2141},{"PID":7105,"name":"#2炉#1引风机电机","DID":2190},{"PID":7105,"name":"#2炉#1送风机","DID":2191},{"PID":7105,"name":"#2炉#2一次风机","DID":2193},{"PID":7105,"name":"#2炉#2引风机电机","DID":2195},{"PID":7105,"name":"#2炉#2送风机","DID":2197},{"PID":7105,"name":"#2循环水泵电机","DID":2199},{"PID":7108,"name":"#6机A凝结水泵","DID":2200},{"PID":7108,"name":"#6机A循环水泵","DID":2202},{"PID":7108,"name":"#6机A真空泵","DID":2204},{"PID":7108,"name":"#6机A给水泵电机","DID":2206},{"PID":7108,"name":"#6机B凝结水泵电机","DID":2208},{"PID":7108,"name":"#6机B循环水泵电机","DID":2210},{"PID":7108,"name":"#6机B给水泵电机","DID":2212},{"PID":7108,"name":"#6炉A一次风机电机","DID":2214},{"PID":7108,"name":"#6炉A磨煤机","DID":2216},{"PID":7108,"name":"#6炉B一次风机电机","DID":2218},{"PID":7108,"name":"#6炉B磨煤机","DID":2220},{"PID":7109,"name":"#7机A凝结水泵","DID":2222},{"PID":7109,"name":"#7机A循环水泵","DID":2224},{"PID":7109,"name":"#7机A真空泵电机","DID":2226},{"PID":7109,"name":"#7机A给水泵电机","DID":2228},{"PID":7109,"name":"#7机B凝结水泵电机","DID":2230},{"PID":7109,"name":"#7机B循环水泵","DID":2231},{"PID":7109,"name":"#7机B循环水泵电机","DID":2232},{"PID":11061,"name":"#2汽轮机","DID":400},{"PID":7107,"name":"#2机#2定冷水泵","DID":2159},{"PID":7106,"name":"#1启动锅炉房#3给水泵","DID":2161},{"PID":7104,"name":"#1机#1凝结水泵电机","DID":2163},{"PID":7104,"name":"#1机#2凝结水泵电机","DID":2165},{"PID":7104,"name":"#1机#2给水泵","DID":2167},{"PID":7104,"name":"#1机A凝结水泵","DID":2169},{"PID":7104,"name":"#1炉#1一次风机电机","DID":2171},{"PID":7104,"name":"#1炉#1引风机电机","DID":2173},{"PID":7104,"name":"#1炉#1送风机电机","DID":2175},{"PID":7104,"name":"#1炉#2一次风机电机","DID":2177},{"PID":7104,"name":"#1炉#2引风机电机","DID":2179},{"PID":7104,"name":"#1炉#2送风机电机","DID":2181},{"PID":7105,"name":"#2机#1凝结水泵电机","DID":2183},{"PID":7105,"name":"#2机#2给水泵电机","DID":2185},{"PID":7105,"name":"#2炉#1一次风机","DID":2187},{"PID":7105,"name":"#2炉#1引风机","DID":2189},{"PID":7105,"name":"#2炉#1送风机电机","DID":2192},{"PID":7105,"name":"#2炉#2一次风机电机","DID":2194},{"PID":7105,"name":"#2炉#2引风机静叶","DID":2196},{"PID":7105,"name":"#2炉#2送风机电机","DID":2198},{"PID":7108,"name":"#6机A凝结水泵电机","DID":2201},{"PID":7108,"name":"#6机A循环水泵电机","DID":2203},{"PID":7108,"name":"#6机A给水泵","DID":2205},{"PID":7108,"name":"#6机B凝结水泵","DID":2207},{"PID":7108,"name":"#6机B循环水泵","DID":2209},{"PID":7108,"name":"#6机B给水泵","DID":2211},{"PID":7108,"name":"#6机C凝结水泵电机","DID":2213},{"PID":7108,"name":"#6炉A引风机电机","DID":2215},{"PID":7108,"name":"#6炉A送风机电机","DID":2217},{"PID":7108,"name":"#6炉B引风机电机","DID":2219},{"PID":7108,"name":"#6炉B送风机电机","DID":2221},{"PID":7109,"name":"#7机A凝结水泵电机","DID":2223},{"PID":7109,"name":"#7机A循环水泵电机","DID":2225},{"PID":7109,"name":"#7机A给水泵","DID":2227},{"PID":7109,"name":"#7机B凝结水泵","DID":2229},{"PID":11052,"name":"#1汽轮机","DID":1050},{"PID":11052,"name":"#1机A汽动给水泵","DID":1052},{"PID":11053,"name":"#2机A汽动给水泵","DID":1054},{"PID":11052,"name":"#1机A循环水泵","DID":1056},{"PID":11052,"name":"#1机C循环水泵","DID":1058},{"PID":11052,"name":"#1机B凝结水泵","DID":1060},{"PID":11052,"name":"#1炉A一次风机","DID":1062},{"PID":11052,"name":"#1炉A引风机","DID":1064},{"PID":11052,"name":"#1炉A送风机","DID":1066},{"PID":11052,"name":"#1炉B送风机","DID":1067},{"PID":11052,"name":"#1炉B磨煤机","DID":1069},{"PID":11052,"name":"#1炉F磨煤机","DID":1073},{"PID":11053,"name":"#2机B循环水泵","DID":1075},{"PID":11053,"name":"#2机B凝结水泵","DID":1077},{"PID":11053,"name":"#2机C凝结水泵","DID":1079},{"PID":11053,"name":"#2炉B一次风机","DID":1081},{"PID":11053,"name":"#2炉B引风机","DID":1083},{"PID":11053,"name":"#2炉B磨煤机","DID":1087},{"PID":11053,"name":"#2炉D磨煤机","DID":1089},{"PID":11053,"name":"#2炉E磨煤机","DID":1090},{"PID":11050,"name":"#1机A循环水泵","DID":2103},{"PID":11050,"name":"#1机A汽泵小汽轮机","DID":2105},{"PID":11050,"name":"#1机B汽动给水泵","DID":2107},{"PID":11050,"name":"#1炉A送风机","DID":2109},{"PID":11051,"name":"#2机A凝结水泵","DID":2111},{"PID":11051,"name":"#2炉A送风机","DID":2113},{"PID":7102,"name":"#6机A凝结水泵","DID":2115},{"PID":7102,"name":"#6机A循环水泵","DID":2117},{"PID":7109,"name":"#7机B给水泵电机","DID":2234},{"PID":7109,"name":"#7机C凝结水泵","DID":2236},{"PID":7109,"name":"#7炉A一次风机电机","DID":2238},{"PID":7109,"name":"#7炉A磨煤机","DID":2240},{"PID":7109,"name":"#7炉B一次风机电机","DID":2242},{"PID":7109,"name":"#7炉B磨煤机","DID":2244},{"PID":7102,"name":"#6汽轮机","DID":3050},{"PID":7103,"name":"#7汽轮机","DID":3052},{"PID":7102,"name":"#6A引风机","DID":3054},{"PID":7103,"name":"#7A引风机","DID":3056},{"PID":7109,"name":"#7机B给水泵","DID":2233},{"PID":7109,"name":"#7炉A引风机电机","DID":2239},{"PID":7109,"name":"#7机C凝结水泵电机","DID":2237},{"PID":7109,"name":"#7炉A送风机电机","DID":2241},{"PID":7109,"name":"#7炉B引风机电机","DID":2243},{"PID":7109,"name":"#7炉B送风机电机","DID":2245},{"PID":7102,"name":"#6B引风机","DID":3055},{"PID":7103,"name":"#7B引风机","DID":3057},{"PID":7104,"name":"#1循环水泵电机","DID":6050},{"PID":25,"name":"#6机组","DID":7108},{"PID":22,"name":"#2机组","DID":11051},{"PID":7107,"name":"#2汽轮机","DID":11057},{"PID":26,"name":"#1机组","DID":11060},{"PID":23,"name":"#7机组","DID":7103},{"PID":24,"name":"#2机组","DID":7105},{"PID":25,"name":"#7机组","DID":7109},{"PID":7105,"name":"#2汽轮机","DID":11055},{"PID":21,"name":"#1机组","DID":11052},{"PID":7106,"name":"#1汽轮机","DID":11056},{"PID":7108,"name":"#6汽轮机","DID":11058},{"PID":7109,"name":"#7汽轮机","DID":11059},{"PID":26,"name":"#2机组","DID":11061},{"PID":11051,"name":"#2汽轮机","DID":7101},{"PID":23,"name":"#6机组","DID":7102},{"PID":24,"name":"#1机组","DID":7104},{"PID":27,"name":"#1机组","DID":7106},{"PID":22,"name":"#1机组","DID":11050},{"PID":21,"name":"#2机组","DID":11053},{"PID":7104,"name":"#1汽轮机","DID":11054},{"PID":11060,"name":"#1汽轮机","DID":351},{"PID":11053,"name":"#2炉B送风机","DID":1085},{"PID":27,"name":"#2机组","DID":7107},{"PID":7102,"name":"#6炉A一次风机","DID":12052},{"PID":12052,"name":"#6炉A一次风机轴承箱","DID":12054},{"PID":11050,"name":"#1汽轮机","DID":7100},{"PID":11052,"name":"#1炉D磨煤机","DID":1071},{"PID":11053,"name":"#2炉C磨煤机","DID":1088},{"PID":7103,"name":"#7机A凝结水泵电机前端盖","DID":2129},{"PID":12052,"name":"#6炉A一次风机径向轴承","DID":12053},{"PID":13050,"name":"新位置","DID":13051}]
     * message : 读取数据成功
     */

    private String code;
    private String message;
    private List<DataBean> data;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * PID : 0
         * name : 国家电投
         * DID : 1
         */

        private int PID;
        private String name;
        private int DID;

        public int getPID() {
            return PID;
        }

        public void setPID(int PID) {
            this.PID = PID;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public int getDID() {
            return DID;
        }

        public void setDID(int DID) {
            this.DID = DID;
        }
    }
}
